In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.562934  1.607382
1    a  two  0.724953  0.701426
2    b  one  0.989314 -2.427180
3    b  two -0.402382  0.899651
4    a  one -1.119328 -0.023665

In [2]:
grouped = df['data1'].groupby(df['key1'])

In [3]:
grouped

In [4]:
grouped.mean()

key1
a    0.389520
b    0.293466
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [6]:
means

key1  key2
a     one     0.221803
      two     0.724953
b     one     0.989314
      two    -0.402382
Name: data1, dtype: float64

In [7]:
means.unstack()

key2       one       two
key1
a     0.221803  0.724953
b     0.989314 -0.402382

In [8]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()#how to group

California  2005    0.724953
            2006    0.989314
Ohio        2005    0.580276
            2006   -1.119328
Name: data1, dtype: float64

In [9]:
df

  key1 key2     data1     data2
0    a  one  1.562934  1.607382
1    a  two  0.724953  0.701426
2    b  one  0.989314 -2.427180
3    b  two -0.402382  0.899651
4    a  one -1.119328 -0.023665

In [10]:
df.groupby(df['key1']).mean()

         data1     data2
key1
a     0.389520  0.761714
b     0.293466 -0.763764

In [11]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.221803  0.791858
     two   0.724953  0.701426
b    one   0.989314 -2.427180
     two  -0.402382  0.899651

In [12]:
df.groupby(['key1','key2']).size()#if group include NAN ,it will be removed from result

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [13]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.562934  1.607382
1    a  two  0.724953  0.701426
4    a  one -1.119328 -0.023665
b
  key1 key2     data1     data2
2    b  one  0.989314 -2.427180
3    b  two -0.402382  0.899651

In [14]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.562934  1.607382
4    a  one -1.119328 -0.023665
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.724953  0.701426
('b', 'one')
  key1 key2     data1    data2
2    b  one  0.989314 -2.42718
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.402382  0.899651

In [15]:
pieces = dict(list(df.groupby('key1')))

In [16]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.562934  1.607382
 1    a  two  0.724953  0.701426
 4    a  one -1.119328 -0.023665, 'b':   key1 key2     data1     data2
 2    b  one  0.989314 -2.427180
 3    b  two -0.402382  0.899651}

In [17]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.989314 -2.427180
3    b  two -0.402382  0.899651

In [18]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [19]:
grouped = df.groupby(df.dtypes,axis=1)

In [20]:
grouped

In [21]:
for dtype,group in grouped:
    print(dtype)#it read the series of dtypes firstly.
    print(group)#and the according to series to group data.

float64
      data1     data2
0  1.562934  1.607382
1  0.724953  0.701426
2  0.989314 -2.427180
3 -0.402382  0.899651
4 -1.119328 -0.023665
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [22]:
df.groupby('key1')['data1']#Equivalent to df['data1'].groupby[df['key1']]

In [23]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.791858
     two   0.701426
b    one  -2.427180
     two   0.899651

In [24]:
s_grouped = df.groupby(['key1','key2'])['data2']
s_grouped

In [25]:
s_grouped.mean()#why it entered as one column

key1  key2
a     one     0.791858
      two     0.701426
b     one    -2.427180
      two     0.899651
Name: data2, dtype: float64

In [26]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                     index=['Joe','Steve','Wes','Jim','Travis'])

In [27]:
people.iloc[2:3,[1,2]] = np.nan

In [28]:
people

               a         b         c         d         e
Joe    -0.768002 -1.873333 -1.543295 -1.296238  1.426899
Steve  -1.685469 -0.176825 -0.411776 -0.392713 -0.738101
Wes    -0.676523       NaN       NaN -0.004436  1.266210
Jim    -0.801219  0.894503 -1.353744  1.079710 -1.050982
Travis -0.320556  0.687643  0.464616  0.863055  0.506068

In [29]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [30]:
by_column = people.groupby(mapping,axis=1)

In [31]:
by_column.sum()

            blue       red
Joe    -2.839534 -1.214436
Steve  -0.804489 -2.600395
Wes    -0.004436  0.589687
Jim    -0.274034 -0.957698
Travis  1.327671  0.873155

In [32]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [33]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3